ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/GTC0_GTC_CFG1.xml
<module name="GTC0_GTC_CFG1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="GTC_CFG1_CNTCR" acronym="GTC_CFG1_CNTCR" offset="0x0" width="32" description="">
		<bitfield id="CNTCR_FCREQ" width="24" begin="31" end="8" resetval="0x0" description="Frequency Change Request" range="31 - 8" rwaccess="R"/> 
		<bitfield id="CNTCR_HDBG" width="1" begin="1" end="1" resetval="0x0" description="Halt on Debug" range="1" rwaccess="R/W"/> 
		<bitfield id="CNTCR_EN" width="1" begin="0" end="0" resetval="0x0" description="Enable System Counter" range="0" rwaccess="R/W"/>
	</register>
	<register id="GTC_CFG1_CNTSR" acronym="GTC_CFG1_CNTSR" offset="0x4" width="32" description="">
		<bitfield id="CNTSR_FCACK" width="24" begin="31" end="8" resetval="0x0" description="Frequency Change Ackowledge" range="31 - 8" rwaccess="R"/> 
		<bitfield id="CNTSR_DBGH" width="1" begin="1" end="1" resetval="0x0" description="Debug Halt" range="1" rwaccess="R"/>
	</register>
	<register id="GTC_CFG1_CNTCV_LO" acronym="GTC_CFG1_CNTCV_LO" offset="0x8" width="32" description="">
		<bitfield id="CNTCV_LO_COUNTVALUE" width="32" begin="31" end="0" resetval="0x0" description="Indicates bits [31:0] of the System Counter value." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="GTC_CFG1_CNTCV_HI" acronym="GTC_CFG1_CNTCV_HI" offset="0xC" width="32" description="">
		<bitfield id="CNTCV_HI_COUNTVALUE" width="32" begin="31" end="0" resetval="0x0" description="Indicates bits [63:32] of the System Counter value." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="GTC_CFG1_CNTFID0" acronym="GTC_CFG1_CNTFID0" offset="0x20" width="32" description="">
		<bitfield id="CNTFID0_FREQVALUE" width="32" begin="31" end="0" resetval="0x0" description="Indicates the base update frequency of the System Counter in Hz." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="GTC_CFG1_CNTFID1" acronym="GTC_CFG1_CNTFID1" offset="0x24" width="32" description="">
		<bitfield id="CNTFID1_FREQVALUE" width="32" begin="31" end="0" resetval="0x0" description="Frequency table end indicator" range="31 - 0" rwaccess="R"/>
	</register>
</module>